import { Banner2 } from "../components/banner";
import DisclosureItem from "../components/DisclosureItem";
import Tab from "../components/Tab";

function Faq() {
  const faqItemsInfo = [
    {
      id: 1,
      desktopTitle: "ترخینه چه امکانات متفاوتی دارد",
      title: "امکانات ترخینه ",
      description:
        "وبسایت سفارش غذای رستوران‌های زنجیره‌ای ترخینه با اتصال مستقیم به نرم افزار اتوماسیون شعبات رستوران، امکان اشتباهات هنگام ثبت سفارش آنلاین غذا و همچنین زمان مورد نیاز برای آماده سازی و تحویل آن را به حداقل ممکن می رسونه.",
    },
    {
      id: 2,
      desktopTitle: "چطور می تونم در ترخینه حساب کاربری ایجاد کنم؟",
      title: "حساب کاربری در ترخینه",
      description:
        "خیلی ساده، پس از انتخاب غذای مورد علاقه تان از منوی رستوران، هنگام ثبت سفارش با وارد کردن شماره تلفن همراه یک پیامک حاوی کد تایید برای شما ارسال و با وارد کردن کد تایید، ثبت نام شما تکمیل می شه. یا می تونید در صفحه اصلی سایت روی گزینه ورود کلیک کنید.",
    },
    {
      id: 3,
      desktopTitle: "سابقه و لیست خریدهای قبلی ام رو کجا ببینم؟",
      title: "سابقه خرید",
      description:
        "با ورود به حساب کاربری و کلیک روی گزینه سفارشات قبلی سابقه تمام خریدهای شما نمایش داده می شه.",
    },
    {
      id: 4,
      desktopTitle: "چه راه هایی برای پرداخت دارم؟",
      title: "راه‌های پرداخت",
      description:
        "با ورود به حساب کاربری و کلیک روی گزینه سفارشات قبلی سابقه تمام خریدهای شما نمایش داده می شه.",
    },
    {
      id: 5,
      desktopTitle:
        "آیا قیمت در منوی وبسایت ترخینه با قیمت منوی شعبات رستوران یکسان است؟",
      title: "تفاوت قیمت در منو شعبات و منو وبسایت",
      description:
        "بله. قیمت منوی وبسایت ترخینه دقیقا مطابق با قیمت منوی شعب رستوران  است و در صورت تغییر قیمت از طرف رستوران این تغییر در وبسایت ترخینه بلافاصله قابل مشاهده است.",
    },
    {
      id: 6,
      desktopTitle: "چطور می تونم از اعتبار هدیه و تخفیف استفاده کنم؟",
      title: "هدیه و تخفیف",
      description:
        "برای استفاده از کد تخفیف میتونید به سادگی کد رو در سبد خرید، در قسمت مشخص شده وارد کنید. اعتبار هدیه هنگام انتخاب روش پرداخت برای شما نمایش داده میشه و در صورت تمایل میتونید ازش استفاده کنید.",
    },
  ];
  return (
    <>
      <Banner2 title={"سوالات متداول از ترخینه"} className={"bg-faqBanner"} />
      <Tab />

      <div className="container border py-4 my-4 rounded-sm border-neutral-400">
        {faqItemsInfo.map((item) => {
          return <DisclosureItem {...item} />;
        })}
      </div>
    </>
  );
}

export default Faq;
