import Tab from "../components/Tab";
import { Banner2 } from "../components/banner";
import DisclosureItem from "../components/DisclosureItem";

function Privacy() {
  const privacyItemInfo = [
    {
      id: 1,
      title: "حریم خصوصی",
      desktopTitle: "حریم خصوصی",
      description:
        "ترخینه متعهد می‌شود حریم خصوصی شما را حفظ کند و به آن احترام بگذارد. بخش «حریم خصوصی» روش‌های استفاده از اطلاعات شخصی کاربران در این وب سایت را شرح می‌دهد. اگر برای سفارش غذای خوب از خدمات ما استفاده می‌کنید، سیاست‌های حفظ حریم خصوصی وب‌سایت ترخینه، در مورد شما صدق می‌کند. پردازش و ارسال سفارش‌ها نیازمند اطلاعات دقیق کاربران است؛ برای این‌که بتوانیم خدمات مطلوب‌تری به شما ارائه دهیم، ممکن است به هنگام خرید، ثبت نظر و استفاده از برخی امکانات سایت، به اطلاعات شما نیاز داشته باشیم؛ هم‌چنین ترخینه برای ارتباط با مشتریان، بهبود رابط کاربری، بهینه‌سازی محتوا و تحقیقات بازاریابی، بایستی از اطلاعات کاربران خود استفاده کند. این در حالی است که اطلاع‌رسانی خدمات جدید و سرویس‌های ویژه یا پروموشن‌ها، اخبار و رویدادها با ارسال ایمیل یا پیامک به کاربران انجام می‌شود.",
    },
    {
      id: 2,
      title: "چه اطلاعاتی را گردآوری میکنیم؟",
      desktopTitle: "چه اطلاعاتی را گردآوری میکنیم؟",
      description:
        "اطلاعاتی که درباره شما گردآوری میکنیم ممکن است شامل موارد زیر باشد: نام و نام خانوادگی شما شماره تلفن همراه تاریخ تولد نشانی مورد نظر برای تحویل سفارش ها و اطلاعات دیگری که شما برای ما نوشته اید یا از راه های دیگر در اختیار ما قرار داده اید.",
    },
    {
      id: 3,
      title: "چگونه اطلاعات شما را گردآوری میکنیم؟",
      desktopTitle: "چه اطلاعاتی را گردآوری میکنیم؟",
      description:
        "از شما تقاضا خواهیم کرد اطلاعات خود را در اختیار ما قرار دهید هنگامی که: به شکل کاربر مهمان غذا سفارش میدهید. در ویب سایت ترخینه یک حساب کاربری ایجاد میکنید. در قسمت اعطای نمایندگی فرم پر میکنید",
    },
    {
      id: 4,
      title: "چرا به شماره تلفن شما نیاز داریم؟",
      desktopTitle: "چرا به شماره تلفن شما نیاز داریم؟",
      description:
        "برای ثبت نام در وب‌سایت ترخینه باید نخست شماره موبایل خود را وارد کنید تا کد فعال‌سازی برای شما ارسال شود. شماره تلفن همراه شما نقش نام کاربری را ایفا می‌کند. ممکن است به هر دلیل رمز عبور خود را فراموش کنید؛ در این موقعیت، می‌توانید از تلفن همراه خود کد فعال‌سازی مجدد دریافت کنید. ممکن است برای آگاه کردن شما از اخبار و تغییرات جدید از شماره همراهتان استفاده کنیم؛ مانند، اطلاع‌رسانی از تغییر شیوه‌ی دسترسی شما به خدمات آنلاین ما، یا خدمات جدید و پیشنهادهای خاص.",
    },
    {
      id: 5,
      title: "فعالیت های مرورگر شما",
      desktopTitle: "فعالیت های مرورگر شما در هنگام بازدید از وب سایت ترخینه",
      description:
        "هنگامی‌که شما از وب‌سایت ترخینه استفاده می‌کنید، ما اطلاعاتی درباره‌ی فعالیت‌های شما گردآوری می‌کنیم که برخی از این اطلاعات عبارتند ",
    },
    {
      id: 6,
      title: "استفاده از کوکی ها",
      desktopTitle: "استفاده از کوکی ها و ذخیره ساز های دیگر",
      description:
        "کوکی‌ها فایل‌های اطلاعاتی هستند که روی کامپیوتر شما ذخیره می‌شوند تا به وب‌سایت‌ها کمک کنند شما را به خاطر بیاورند. ما و همکاران‌مان، با استفاده از کوکی‌ها اطلاعاتی درباره شیوه‌ی استفاده شما از وب‌سایت‌مان گردآوری می‌کنیم؛ این اطلاعات ما را در بهبود رابط کاربری و محتوای سایت کمک خواهد کرد. شما نیز به وسیله‌ی ثبت و ذخیره‌سازی این کوکی‌ها، هنگام ورود مجدد به سایت، نیازی به ثبت مجدد نام کاربری و کلمه‌ی عبور نخواهید داشت. هم‌چنین ما به وسیله‌ی کوکی‌ها، آخرین وضعیت سفارش روز شما را ذخیره می‌کنیم تا شما بتوانید آن‌ها را در پروفایل خود مشاهده کنید.",
    },
    {
      id: 7,
      title: "اطلاعات بیشتر",
      desktopTitle: "اطلاعات بیشتر",
      description:
        "در مجموعه‌ی ترخینه، حفظ امنیت اطلاعات شخصی شما را امری بسیار جدی و مهم می‌دانیم و در وب‌سایت خود از سیاست‌های امنیتی و فناوری‌هایی استفاده می‌کنیم که برای محافظت از اطلاعات شخصی طراحی شده‌اند؛ هم‌چنین از روش‌ها و دستورالعمل‌های امنیتی سختی که قوانین حفظ حریم خصوصی کاربران به آن‌ها نیاز دارد، پیروی می‌کنیم. این روش‌های محافظتی ذخیره‌سازی، استفاده و انتشار همه‌ی اطلاعات شما را دربر می‌گیرد و از دسترسی و استفاده‌ی غیرمجاز از این اطلاعات جلوگیری می‌کند.",
    },
  ];
  return (
    <>
      <Banner2 className={"bg-privacyBanner"} title={"حریم شخصی کاربران"} />
      <Tab />

      <div className="container border py-4 my-4 rounded-sm border-neutral-400">
        {privacyItemInfo.map((item) => {
          return <DisclosureItem {...item} key={item.id} />;
        })}
      </div>
    </>
  );
}

export default Privacy;
