import { Banner2 } from "../components/banner";
import DisclosureItem from "../components/DisclosureItem";
import Tab from "../components/Tab";

function Rules() {
  const rulesItemInfo = [
    {
      id: 1,
      desktopTitle: "حداقل سفارش",
      title: "حداقل سفارش",
      description:
        "حداقل سفارشات در رستوران‌های ترخینه، مبلغ ۵۰.۰۰۰ تومان است. برای ثبت، پردازش و ارسال سفارشات، باید حداقل، این مبلغ سفارش داده شود در غیر اینصورت سفارشات، ثبت نخواهد شد.",
    },
    {
      id: 2,
      desktopTitle: "فاصله تحویل",
      title: "فاصله تحویل",
      description:
        "ترخینه در ارسال سفارشات به نقاط دور محدودیت دارد و حداکثر فاصله از رستوران‌های زنجیره‌ای ترخینه برای ارسال کالا، ۶ کیلومتر است. لطفا قبل از ثبت سفارش، نزدیک‌ترین شعبه به محل ارسال را انتخاب کنید و از رعایت کردن حداکثر فاصله برای ارسال سفارشات اطمینان حاصل فرمایید.",
    },
    {
      id: 3,
      desktopTitle: "زمان تحویل",
      title: "زمان تحویل",
      description:
        "جدول زمانی تخمینی تحویل در زمان ثبت سفارش به اطلاع شما خواهد رسید. این ممکن است تحت تأثیر عوامل زیادی مانند ترافیک، آب و هوا، دوره‌های شلوغ رستوران و غیره باشد، بنابراین در صورت تأخیر لطفا صبور باشید.",
    },
    {
      id: 4,
      desktopTitle: "گزینه های پرداخت",
      title: "گزینه های پرداخت",
      description:
        "ما گزینه‌های پرداخت مختلفی را می پذیریم، از جمله پرداخت اینترنتی، کارت‌های اعتباری یا پول نقد. لطفاً قبل از تکمیل سفارش، روش پرداختی را که ترجیح می دهید، تأیید کنید.",
    },
    {
      id: 5,
      desktopTitle: "دقت سفارش",
      title: "دقت سفارش",
      description:
        "لطفاً قبل از ارسال، از دقیق بودن تمام جزئیات سفارش خود، از جمله موارد منو، دستورالعمل‌های خاص و جزئیات سفارش خود اطمینان حاصل کنید تا اختلالی در فرایند پردازش و تحویل سفارشات شما ایجاد نشود و سفارشات شما در سریع‌ترین زمان ممکن به دست‌تان برسد.",
    },
    {
      id: 6,
      desktopTitle: "شرایط لغو سفارش",
      title: "شرایط لغو سفارش",
      description:
        "شما می‌توانید با تماس مستقیم با هر شعبه از رستوران‌های زنجیره‌ای ترخینه، سفارش خود را لغو کنید. لطفا توجه داشته باشید که ممکن است محدودیت زمانی برای لغو وجود داشته باشد، زیرا ممکن است غذا از قبل آماده شده باشد و در اینصورت متاسفانه امکان لغو سفارش وجود ندارد.",
    },
    {
      id: 7,
      desktopTitle: "شرایط بازگشت سفارش",
      title: "شرایظ بازگشت سفارش",
      description:
        "اگر سفارش شما انتظارات شما را برآورده نمی کند، لطفاً بلافاصله از طریق تماس تلفنی با ما تماس بگیرید؛ ما در اسرع وقت به دنبال حل مشکل شما خواهیم بود.",
    },
    {
      id: 8,
      desktopTitle: "تخفیفات",
      title: "تخفیفات",
      description:
        "هر‌گونه تخفیف یا برنامه‌های وفاداری ممکن است قوانین و شرایط خاصی داشته باشد که به وضوح در وب سایت مشخص می‌شود.",
    },
  ];

  return (
    <>
      <Banner2 className={"bg-rulesBanner"} title={"قوانین ترخینه"} />
      <Tab />

      <div className="container border py-4 my-4 rounded-sm border-neutral-400">
        {rulesItemInfo.map((item) => {
          return <DisclosureItem {...item} key={item.id} />;
        })}
      </div>
    </>
  );
}

export default Rules;
